package com.greedy.answer;

public class OperationPractice {

	public String practice1(int num1) {
		
		return (num1 > 0)? "양수다" : "양수가 아니다" ;
		/*
		 * 키보드로 입력 받은 하나의 정수가 양수이면 “양수다“, 양수가 아니면 “양수가 아니다“를 출력하세요.
		 * ex. 
		 * 정수 : -9
		 * 양수가 아니다
		 * */
		
	}
	
	public String practice2(int num2) {
		return (num2>0)? "양수다" : (num2 == 0)? "0이다" : "음수다";
		/*
		 * 키보드로 입력 받은 하나의 정수가 양수이면 “양수다“, 
		 * 양수가 아닌 경우 중에서 0이면 “0이다“, 0이 아니면 “음수다”를 출력하세요
		 * 
		 * ex.
		 * 정수 : -9
		 * 음수다
		 * */
	}
	
	public String practice3(int num3) {
		
		return ((num3 % 2) == 1)? "홀수다" : "짝수다";
		/*
		 * 키보드로 입력 받은 하나의 정수가 짝수이면 “짝수다“, 짝수가 아니면 “홀수다“를 출력하세요.
		 * 
		 * ex.
		 * 정수 : 5
		 * 홀수다
		 * */
	}
	
	public String practice4(int h1, int c1) {
		
		int forh = (c1 / h1);
				
		return "1인당 사탕 개수 : " + forh + " 남은 사탕개수 : " +(c1 - (forh * h1)); 
		/*
		 * 모든 사람이 사탕을 골고루 나눠가지려고 한다. 인원 수와 사탕 개수를 키보드로 입력 받고
		 * 1인당 동일하게 나눠가진 사탕 개수와 나눠주고 남은 사탕의 개수를 출력하세요.
		 * 
		 * ex.
		 * 인원 수 : 29
		 * 사탕 개수 : 100
		 * 
		 * 1인당 사탕 개수 : 3
		 * 남는 사탕 개수 : 13
		 * */
	}
	
	public String practice5(char gender) {
		int sg = gender;
		return (sg == 77)? "남학생" : (sg == 109)? "남학생" :"여학생" ;
		/* 
		 * 키보드로 입력 받은 값들을 변수에 기록하고 저장된 변수 값을 화면에 출력하여 확인하세요.
		   이 때 성별이 ‘M’이면 남학생, ‘M’이 아니면 여학생으로 출력 처리 하세요.
		   
		   ex.
		   이름 : 홍길동
		   학년(숫자만) : 3
		   반(숫자만) : 4
		   번호(숫자만) : 15
		   성별(M/F) : M
		   성적(소수점 아래 둘째자리까지) : 85.75

		   3학년 4반 15번 홍길동 남학생의 성적은 85.75이다.
	     */

	}
	
	public String practice6(int age) {
		return (age <= 13)? "어린이": (age > 19)? "성인" : "청소년";
		/*
		 * 나이를 키보드로 입력 받아 어린이(13세 이하)인지, 청소년(13세 초과 ~ 19세 이하)인지,
		 * 성인(19세 초과)인지 출력하세요.
		 * 
		 *  ex.
		 *	나이 : 19
		 *	청소년
		 */
		
	}
	public String practice7(char pn) {
		return (pn == 1)? "남자" : "여자";
		
		/*
		 * 주민번호를 이용하여 남자인지 여자인지 구분하여 출력하세요
		 * ex.
		 * 주민번호를 입력하세요(- 포함) : 132456-2123456
		 * 여자
		*/

	}
}
